[
  {
    "id": 1,
    "cover": "https://upload.wikimedia.org/wikipedia/en/b/b6/NarutoGaidenSeventhHokage.png",
    "title": "Naruto: The Seventh Hokage and the Scarlet Spring",
    "writer": "Masashi Kishimoto",
    "publisher": "Shueisha",
    "year": 2015,
    "plot": "The story concludes with Sarada gaining a deeper understanding of her parents and her own identity. She decides to follow her own path while cherishing the bonds she has with her family and friends. The manga ends on a hopeful note, showing the next generation of ninja ready to forge their own destinies, with Naruto, Sasuke, and their peers guiding them from the shadows."
  },
  {
    "id": 2,
    "cover": "https://upload.wikimedia.org/wikipedia/en/thumb/e/ec/Attack_on_Titan_No_Regrets%2C_volume_1.jpg/220px-Attack_on_Titan_No_Regrets%2C_volume_1.jpg",
    "title": "Attack on Titan: No Regrets",
    "writer": "Hajime Isayama",
    "publisher": "Kodansha",
    "year": 2013,
    "plot": "This prequel tells the story of Levi Ackerman and how he came to join the Survey Corps. It explores his relationship with his mentor, Erwin Smith, and his early battles against the Titans. The manga delves into themes of sacrifice, duty, and the harsh realities of war."
  },
  {
    "id": 3,
    "cover": "https://upload.wikimedia.org/wikipedia/en/thumb/1/11/Death_Note_Another_Note_book_cover.jpg/200px-Death_Note_Another_Note_book_cover.jpg",
    "title": "Death Note: Another Note",
    "writer": "Tsugumi Ohba",
    "publisher": "Shueisha",
    "year": 2006,
    "plot": "This novel explores the backstory of L, the enigmatic detective from the original series. Set before the events of Death Note, it follows L as he solves a series of murders in Los Angeles, showcasing his deductive skills and introducing new characters who play pivotal roles in his life."
  },
  {
    "id": 4,
    "cover": "https://upload.wikimedia.org/wikipedia/en/3/3f/Bleach_%28manga%29_1.png",
    "title": "Bleach: Can't Fear Your Own World",
    "writer": "Tite Kubo",
    "publisher": "Shueisha",
    "year": 2017,
    "plot": "Set after the events of the original Bleach series, this novel focuses on Shuhei Hisagi as he investigates a new threat to the Soul Society. It dives into the political intrigue and hidden secrets of the Soul Society, revealing more about the pasts of beloved characters and the dark history of the spiritual world."
  },
  {
    "id": 5,
    "cover": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5a/Boku_no_Hero_Academia_Volume_1.png/220px-Boku_no_Hero_Academia_Volume_1.png",
    "title": "My Hero Academia: School Briefs",
    "writer": "Kohei Horikoshi",
    "publisher": "Shueisha",
    "year": 2019,
    "plot": "This light novel series provides a glimpse into the daily lives of the students of U.A. High School. It features slice-of-life stories and character interactions that aren't seen in the main manga, offering fans a deeper understanding of their favorite heroes-in-training and their journey to becoming pro heroes."
  }
]
